---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.EnterValueBetween
source: html/1ef70e0c-9a28-c95d-ef4c-ffa69893b875.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.EnterValueBetween Property

Please enter a value between [Value] and [Value].

## Syntax (C#)
```csharp
public static FailureDefinitionId EnterValueBetween { get; }
```